<!-- placeholder-1 -->
```fish
terraform plan -chdir=. -refresh=true
```
<!-- placeholder-2 -->

<details open><summary>Diff of 3 changes.</summary>

```diff
# module.vm_minimal_config.proxmox_virtual_environment_vm.vm has changed
! module.debian13.proxmox_virtual_environment_vm.vm_template will be updated in-place
! module.ubuntu22.proxmox_virtual_environment_vm.vm_template will be updated in-place
! module.vm_minimal_config.proxmox_virtual_environment_vm.vm is tainted, so must be replaced
```
</details>
<!-- placeholder-3 -->
<details><summary>Plan: 1 to add, 2 to change, 1 to destroy.</br>

<!-- placeholder-4 -->
###### By @b- at 2025-08-08T17:58:05Z [(view log)](https://github.com/perchnet/p/actions/runs/16837172876/job/47699384365#step:11:1).
</summary>

```hcl

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.vm_minimal_config.proxmox_virtual_environment_vm.vm has changed
  ~ resource "proxmox_virtual_environment_vm" "vm" {
        id                  = "10000"
      + ipv4_addresses      = []
      + ipv6_addresses      = []
        name                = "vm-ubuntu22-minimal"
        # (24 unchanged attributes hidden)

        # (9 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.debian13.proxmox_virtual_environment_vm.vm_template will be updated in-place
  ~ resource "proxmox_virtual_environment_vm" "vm_template" {
      ~ description             = "Terraform generated template on 2025-08-08T17:51:26Z" -> (known after apply)
        id                      = "9013"
        name                    = "debian13"
        tags                    = [
            "debian",
            "template",
            "terraform",
        ]
        # (28 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }

  # module.ubuntu22.proxmox_virtual_environment_vm.vm_template will be updated in-place
  ~ resource "proxmox_virtual_environment_vm" "vm_template" {
      ~ description             = "Terraform generated template on 2025-08-08T17:51:26Z" -> (known after apply)
        id                      = "8022"
        name                    = "ubuntu22"
        tags                    = [
            "template",
            "terraform",
            "ubuntu",
        ]
        # (28 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }

  # module.vm_minimal_config.proxmox_virtual_environment_vm.vm is tainted, so must be replaced
-/+ resource "proxmox_virtual_environment_vm" "vm" {
      ~ id                      = "10000" -> (known after apply)
      ~ ipv4_addresses          = [] -> (known after apply)
      ~ ipv6_addresses          = [] -> (known after apply)
      ~ mac_addresses           = [
          - "BC:24:11:3A:A1:2E",
        ] -> (known after apply)
        name                    = "vm-ubuntu22-minimal"
      ~ network_interface_names = [] -> (known after apply)
      ~ started                 = false -> true
        # (23 unchanged attributes hidden)

      ~ cpu {
          - flags        = [] -> null
            # (9 unchanged attributes hidden)
        }

      ~ disk {
          ~ path_in_datastore = "vm-10000-disk-0" -> (known after apply)
            # (14 unchanged attributes hidden)
        }

      ~ initialization {
          - interface            = "ide2" -> null
          + meta_data_file_id    = (known after apply)
          + network_data_file_id = (known after apply)
          ~ type                 = "nocloud" -> (known after apply)
          + user_data_file_id    = (known after apply)
          + vendor_data_file_id  = (known after apply)
            # (1 unchanged attribute hidden)

          + dns {
              + servers = []
            }

            # (2 unchanged blocks hidden)
        }

      ~ network_device {
          - disconnected = false -> null
          ~ mac_address  = "BC:24:11:3A:A1:2E" -> (known after apply)
            # (9 unchanged attributes hidden)
        }

        # (5 unchanged blocks hidden)
    }

Plan: 1 to add, 2 to change, 1 to destroy.
```
</details>
<!-- placeholder-5 -->
<!-- terraform-39-3eee8c84341b95e00d4d4dd1307a8268.tfplan -->
<!-- placeholder-6 -->